Revit 2024 API
GroupTypeId.SegmentsFittings Property
 Segments and Fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId SegmentsFittings { get; }
Visual Basic
Public Shared ReadOnly Property SegmentsFittings As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SegmentsFittings {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace